AcDbDimension.subSetDimstyleData(AcDbObjectId)
This function compares the dimstyle data in the record identified by
newDataId with the data in the record referenced by the dimension,
and applies any differences as dimension variable overrides on the
dimension. So, when this function is finished, the combination of the
referenced DimStyleTableRecord and the newly applied dimension variable
overrides will make the dimension display as though it were actually
referencing the DimStyleTableRecord newDataId.
Remarks:
The DimStyleTableRecord identified by newDataId can be in any database
currently loaded in memory.
newDataId: Input object ID of the AcDbDimStyleTableRecord
whose data is to be applied to this dimension.
Returns:
This function returns Acad::eOk if successful. Acad::eInvalidInput
will be returned if pRecord is not a valid AcDbDimStyleTableRecord.
Acad::eInvalidDimStyle will be returned if the dimension there is an
invalid dimension style associated with this dimension. Various open
codes can be returned if the associated AcDbDimStyleTableRecord cannot
be opened.

AcDbDimension.subSetDimstyleData(AcDbDimStyleTableRecord*)
This function compares the dimstyledata in the record pointed to by
pNewData with the data in the record referenced by the dimension,
and applies any differences as dimension variable overrides on the
dimension. So, when this function is finished, the combination of the
referenced DimStyleTableRecord and the newly applied dimension variable
overrides will make the dimension display as though it were actually
referencing the DimStyleTableRecord pNewData.
Remarks:
The DimStyleTableRecord pointed to by pNewData may be database-resident,
but that is not required for this function to use it. If it is
database-resident, it can be in any database currently loaded in memory.
pNewData: Input pointer to the AcDbDimStyleTableRecord
whose data is to be applied to this dimension.
Returns:
This function returns Acad::eOk if successful. Acad::eInvalidInput
will be returned if pRecord is not a valid AcDbDimStyleTableRecord.
Acad::eInvalidDimStyle will be returned if the dimension there is an
invalid dimension style associated with this dimension. Various open
codes can be returned if the associated AcDbDimStyleTableRecord cannot
be opened.

AcDbDimension.subGetDimstyleData(AcDbDimStyleTableRecord**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function copies the dimstyle information from the AcDbDimStyleTableRecord
referenced by the dimension into the AcDbDimStyleTableRecord pointed to
by pRecord. After copying the data, any dimension variable overrides currently
applied to the dimension will be copied into the record pointed to by pRecord.
The result is that pRecord represents the effective style settings currently
in use by this object.
pRecord: Input pointer to a pre-existing non-database-resident
record.
Returns:
This function returns Acad::eOk if successful. Acad::eInvalidInput will be
returned if pRecord is not a valid AcDbDimStyleTableRecord.
Acad::eInvalidDimStyle will be returned if the dimension there is an invalid
dimension style associated with this dimension. Various open codes can be
returned if the associated AcDbDimStyleTableRecord cannot be opened.
Acad::eNullObjectPointer will be returned if pRecord or the associated
AcDbDimStyleTableRecord is NULL.

AcDbDimension.subSetDimensionStyle(AcDbObjectId)
This function sets the dimension to use the AcDbDimStyleTableRecord with
the object ID styleId.
Remarks:
If styleId is AcDbObjectId::kNull (or just NULL), then when the dimension
is closed it will be set to use the current default dimStyle in the
AutoCAD editor. The text string name within the referenced
DimStyleTableRecord is used for DXF group code 3.
dimStyleId: Input object ID to be used by AcDbDimStyleTableRecord.
Returns:
Returns Acad::eOk if operation is successful.

AcDbDimension.subDimensionStyle
This function returns the object ID of the AcDbDimStyleTableRecord
referenced by the dimension.
Remarks:
The text string name within the referenced DimStyleTableRecord is used
for DXF group code 3.
Returns:
Returns object ID of the AcDbDimStyleTableRecord referenced by the dimension.

AcDbDimension.dimensionText(AcString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function retrieves the text associated with this dimension
sDimText: Receives this dimension's text string
Returns:
Returns Acad::eOk if successful, else an error code
Remarks:
The overload which returns ACHAR * is deprecated and may be removed in a future release

AcDbDimension.resetTextDefinedSize
Reset dimension text defined width and defined height to MText in dimension block.
width:  text defined width
height:  text defined height
Returns:  void

AcDbDimension.setTextDefinedSize(System.Double,System.Double)
Set text defined width and defined height to MText in dimension block
width:  text defined width
height:  text defined height
Returns:  void

AcDbDimension.textDefinedSize(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Get dimension text defined width and defined height from MText in dimension block
width:  text defined width to return
height:  text defined height to return
Returns:  void